// ! ||--------------------------------------------------------------------------------||
// ! ||                                Первая программа                                ||
// ! ||--------------------------------------------------------------------------------||

const d = 7;

alert(
    `Я первая программа \n
    Изначальное значение = ${d} \n
    ${d} в квадрате = ${d ** 2} \n
    ${d} в кубе = ${d ** 3}`
);

// ! ||--------------------------------------------------------------------------------||
// ! ||                                Вторая программа                                ||
// ! ||--------------------------------------------------------------------------------||

const firstNumber = Number(prompt("Введите первое ЦЕЛОЕ число"));
const secondNumber = Number(prompt("Введите второе число, тоже ЦЕЛОЕ"));

if (Number.isInteger(firstNumber) & Number.isInteger(secondNumber)) {
    if (firstNumber > secondNumber) {
        alert(firstNumber + secondNumber);
    } else {
        alert(firstNumber * secondNumber);
    }
} else {
    alert("Числа должны быть ЦЕЛЫМИ!!!");
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                                третья программа                                ||
// ! ||--------------------------------------------------------------------------------||

const firstNumber2 = Number(prompt("Введите ЦЕЛОЕ число"));

if (Number.isInteger(firstNumber2)) {
    if (Math.sign(firstNumber2) == 1) {
        alert(firstNumber2 ** 2);
    } else {
        alert("К сожалению число не является положительным");
    }
} else {
    alert("Число должно быть ЦЕЛЫМ!");
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                               четвертая программа                              ||
// ! ||--------------------------------------------------------------------------------||

const students = prompt("Сколько учеников?");
const chairs = prompt("Сколько стульев?");

Number(students) <= Number(chairs)
    ? alert("Ученикам хватит стульев")
    : alert("Каким-то ученикам придется стоять");

// ! ||--------------------------------------------------------------------------------||
// ! ||                                 пятая программа                                ||
// ! ||--------------------------------------------------------------------------------||

const values = [
    -3, -2, -1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
    1, 2, 3, 4,
]; // массив с числами для программ 5, 6, 7, 8, 9, 10

const valuesLength = values.length;

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (Math.sign(value) == 1) {
        if (value.toString().length == 1) {
            console.log(value);
        }
    } else {
        console.log("Число отрицательное"); // в консоли будет 3 отрицательных числа
    }
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                                шестая программа                                ||
// ! ||--------------------------------------------------------------------------------||

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (value >= 15) {
        console.log(value);
    }
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                                седьмая программа                               ||
// ! ||--------------------------------------------------------------------------------||

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (value % 2 !== 0) {
        console.log(value);
    }
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                                восьмая программа                               ||
// ! ||--------------------------------------------------------------------------------||

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (i % 3 === 0) {
        console.log(value);
    }
}

// ! ||--------------------------------------------------------------------------------||
// ! ||                                девятая программа                               ||
// ! ||--------------------------------------------------------------------------------||

let sum = 0; // переменная для записи суммы из if

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (value % 2 !== 0) {
        sum += value;
    }
}

console.log(sum);

// ! ||--------------------------------------------------------------------------------||
// ! ||                                десятая программа                               ||
// ! ||--------------------------------------------------------------------------------||

let sum2 = 0; // вторая переменная для записи суммы из if

for (let i = 0; i < valuesLength; ++i) {
    value = values[i];
    if (value % 2 !== 0) {
        sum += value;
    } else {
        sum2 += value;
    }
}

if (sum > sum2) {
    console.log(sum - sum2);
} else {
    console.log(sum2 - sum);
}
